{
  "backend/main.mo": "Main Motoko actor implementing a food ordering system with user profiles, food item management (CRUD operations), shopping cart functionality, and order tracking, integrating authorization, blob storage, and migration modules.",
  "backend/migration.mo": "Migration module that converts old data structures (single category per food item) to new structures (multiple categories array) for FoodItem, CartItem, and OrderRecord types during canister upgrades.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend TypeScript/React components, pages, hooks, and configuration files describing the food ordering app's UI structure and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode color tokens for a warm, food-themed design palette.",
  "frontend/index.html": "HTML entry point for the Food Ordering App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, cart, and order history pages within a shared Layout component.",
  "frontend/src/components/CartItem.tsx": "Cart item display component with thumbnail image, quantity increment/decrement controls, price calculation, and remove button functionality.",
  "frontend/src/components/InitializeData.tsx": "Admin-only component that automatically seeds five initial Indian food items (Chicken Biryani, Paneer Tikka, Aloo Paratha, Matar Paneer, Matar Paneer Roti) on first admin login, checking for duplicates by name.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, navigation, footer, and cart badge that wraps all pages using React Router's Outlet. Includes authentication-aware navigation links and social media footer.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states, displays user profile name when authenticated, and handles Internet Identity authentication flow with loading states.",
  "frontend/src/components/OrderCard.tsx": "Displays order details in a card with status badge, total price, and expandable accordion showing individual food items with images and quantities.",
  "frontend/src/components/ProductCard.tsx": "Food item card component displaying product image, name, description, categories, price, preparation time, and add-to-cart button with availability status.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name on first login, blocking interaction until profile is created.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, food items, cart management, order placement, and admin checks. Each hook uses the actor from useActor and manages query/mutation state with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light and dark modes), defining colors for UI elements like backgrounds, borders, primary/secondary colors, and chart colors using HSL values.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the App component with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/CartPage.tsx": "Displays shopping cart with items, quantities, and total price; allows authenticated users to update quantities, remove items, and place orders with navigation to order history on success.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero banner, feature highlights (fast delivery, quality, tracking), and category grid that navigates to products page with selected category filter.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays authenticated user's order history sorted by order ID in descending order, showing empty state with call-to-action if no orders exist.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page with category tabs for filtering food items; authenticated users can add items to cart with toast notifications for success/error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a food ordering e-commerce app with 8 food categories, Internet Identity authentication, shopping cart, order management, and Amazon-style features; includes architectural notes, existing features list, and image requirements for food items."
}