{
  "backend/main.mo": "Main backend actor implementing a food ordering system with user profiles, food item management, cart operations, and order processing, including authorization mixins and blob storage integration.",
  "backend/migration.mo": "Migration module that transforms old actor state (with 'available' and 'preparationTime' fields) to new actor state (with 'isAvailable' and 'prepTime' fields) for food items, cart items, and order records.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to debugging food items query, verifying useQueries hook configuration, and checking InitializeData component execution.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, and styling with emphasis on food ordering functionality and data initialization.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining warm, appetizing color palette for light and dark modes with extensive design tokens.",
  "frontend/index.html": "HTML entry point for the Food Ordering App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, cart, and order history pages wrapped in a Layout component.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying food item details with quantity increment/decrement controls, price calculation, and remove button with loading states.",
  "frontend/src/components/InitializeData.tsx": "Component that automatically seeds the database with initial food items (5 Indian dishes) when an admin user logs in for the first time. Uses React hooks to check admin status and existing items before adding missing ones.",
  "frontend/src/components/Layout.tsx": "Main layout component providing the app structure with sticky header (logo, navigation, cart icon, login button), main content outlet, and footer with social links. Includes ProfileSetup and InitializeData components.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity, displays user profile name when authenticated, and clears query cache on logout.",
  "frontend/src/components/OrderCard.tsx": "Displays a single order with status badge, total price, and expandable accordion showing order items with images, quantities, and prices. Uses color-coded status badges for pending/confirmed/preparing/delivered states.",
  "frontend/src/components/ProductCard.tsx": "Food item card component displaying image, name, description, categories, prep time, price, and add-to-cart button. Features hover effects, category badges with custom colors, and unavailable state overlay.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter their name. Cannot be dismissed until name is submitted.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with proper authentication, initializes access control with admin token from URL params, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with support for delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, food items, cart management, order history, and admin functions, wrapping actor calls with proper caching and invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light/dark modes) including colors for primary, secondary, destructive, and chart elements using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page component that displays cart items, allows quantity updates and removal, calculates totals, and handles checkout with authentication checks and loading states.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero banner, category grid for browsing food types (fast food, breakfast, etc.), and feature highlights for delivery, quality, and tracking.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays user's past orders sorted by ID in descending order, with authentication checks and empty state handling that redirects to products page.",
  "frontend/src/pages/ProductsPage.tsx": "Products page component that displays food items in a grid with category filtering tabs, handles add-to-cart functionality with authentication checks, and shows loading/error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/radius/shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking a food ordering e-commerce app with 8 food categories, Internet Identity auth, and existing features for home page, product listings, cart, orders, and visual theme; notes a known issue with food items not displaying on frontend."
}